const option = {
    //图表名称
    name: 'DoubleSidesAreaChart',
    legend: {
        show: true,
        position: {
            right: '5%',
            top: '3%'
        },
        itemWidth: 12,
        itemHeight: 12
    },
    tooltip: {
        valueFormatter: (value) => {
            return value + 'MB';
        }
    },
    yAxis: [
        {
            name: '单位：Mbps',
            nameTextStyle: {
                padding: [0, 0, 0, 12]
            }
        }
    ],
    grid: [
        {
            left: 50,
            right: 50
        },
        {
            left: 50,
            right: 50
        }
    ],
    data: [
        { "Time": '00:00', "上行": 33, "下行": 37 },
        { "Time": '01:00', "上行": 27, "下行": 39 },
        { "Time": '02:00', "上行": 31, "下行": 20 },
        { "Time": '03:00', "上行": 30, "下行": 15 },
        { "Time": '04:00', "上行": 37, "下行": 13 },
        { "Time": '05:00', "上行": 36, "下行": 17 },
        { "Time": '06:00', "上行": 42, "下行": 22 },
        { "Time": '07:00', "上行": 22, "下行": 12 },
        { "Time": '08:00', "上行": 17, "下行": 30 },
        { "Time": '09:00', "上行": 40, "下行": 33 },
        { "Time": '10:00', "上行": 42, "下行": 22 },
        { "Time": '11:00', "上行": 32, "下行": 11 },
        { "Time": '12:00', "上行": 52, "下行": 102 },
        { "Time": '13:00', "上行": 42, "下行": 76 },
        { "Time": '14:00', "上行": 85, "下行": 19 },
        { "Time": '15:00', "上行": 27, "下行": 30 },
        { "Time": '16:00', "上行": 132, "下行": 111 },
        { "Time": '17:00', "上行": 32, "下行": 120 },
        { "Time": '18:00', "上行": 55, "下行": 61 },
        { "Time": '19:00', "上行": 72, "下行": 55 },
        { "Time": '20:00', "上行": 43, "下行": 89 },
        { "Time": '21:00', "上行": 51, "下行": 77 },
        { "Time": '22:00', "上行": 86, "下行": 34 },
        { "Time": '23:00', "上行": 62, "下行": 11 },
        { "Time": '24:00', "上行": 32, "下行": 52 },
    ],
};
